In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', None, 'Eva'],
    'Age': [24, np.nan, 22, 35, 29],
    'Salary': [50000, 60000, np.nan, 70000, 72000],
    'Department': ['HR', 'Finance', 'IT', 'Finance', None]
})

print(df)

      Name   Age   Salary Department
0    Alice  24.0  50000.0         HR
1      Bob   NaN  60000.0    Finance
2  Charlie  22.0      NaN         IT
3     None  35.0  70000.0    Finance
4      Eva  29.0  72000.0       None

In [3]:
print(df.isnull().sum())

Name          1
Age           1
Salary        1
Department    1
dtype: int64

In [4]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].median())
df['Department'] = df['Department'].fillna('Unknown')

In [5]:
print(df)

      Name   Age   Salary Department
0    Alice  24.0  50000.0         HR
1      Bob  27.5  60000.0    Finance
2  Charlie  22.0  65000.0         IT
3     None  35.0  70000.0    Finance
4      Eva  29.0  72000.0    Unknown

In [6]:
df['Age'] = df['Age'].astype(int)
df['Salary'] = df['Salary'].astype(int)
df['Department'] = df['Department'].astype(str)
print(df.dtypes)

Name          object
Age            int64
Salary         int64
Department    object
dtype: object

In [7]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [8]:
def calcular_impuesto(salary):
    return salary * 0.12


df['taxes']= df['Salary'].apply(calcular_impuesto)
print(df)

      Name  Age  Salary Department   taxes
0    Alice   24   50000         HR  6000.0
1      Bob   27   60000    Finance  7200.0
2  Charlie   22   65000         IT  7800.0
3     None   35   70000    Finance  8400.0
4      Eva   29   72000    Unknown  8640.0

In [9]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'Name': ['Ana', 'Luis', 'Carlos', 'Ana', 'Pedro', None],
        'Age': [25, np.nan, 32, 25, 45, 38],
            'Salary': [50000, 60000, None, 50000, 70000, 62000],
                'Department': ['Ventas', 'Marketing', 'TI', 'Ventas', None, 'TI']
                })

print(df)

     Name   Age   Salary Department
0     Ana  25.0  50000.0     Ventas
1    Luis   NaN  60000.0  Marketing
2  Carlos  32.0      NaN         TI
3     Ana  25.0  50000.0     Ventas
4   Pedro  45.0  70000.0       None
5    None  38.0  62000.0         TI

In [10]:
print(df.isnull().sum())

Name          1
Age           1
Salary        1
Department    1
dtype: int64

In [15]:
import pandas as pd
import numpy as np
empleados = pd.DataFrame({
    'Name': ['Ana', 'Luis', 'Carlos', 'Pedro', 'Carlos', 'Richard', 'Ana'],
    'Age': [25, None, 32, 45, 56, None, 25],
    'Salary': [50000, 60000, 70000, 62000, None, 70000, 50000],
    'Department': ['Ventas', 'Marketing', 'TI', 'TI', 'Ventas', 'Marketing', 'Ventas']
})
print(empleados)

      Name   Age   Salary Department
0      Ana  25.0  50000.0     Ventas
1     Luis   NaN  60000.0  Marketing
2   Carlos  32.0  70000.0         TI
3    Pedro  45.0  62000.0         TI
4   Carlos  56.0      NaN     Ventas
5  Richard   NaN  70000.0  Marketing
6      Ana  25.0  50000.0     Ventas

In [16]:
empleados['Age'] = empleados['Age'].fillna(empleados['Age'].median())
print(empleados)

      Name   Age   Salary Department
0      Ana  25.0  50000.0     Ventas
1     Luis  32.0  60000.0  Marketing
2   Carlos  32.0  70000.0         TI
3    Pedro  45.0  62000.0         TI
4   Carlos  56.0      NaN     Ventas
5  Richard  32.0  70000.0  Marketing
6      Ana  25.0  50000.0     Ventas

In [17]:
empleados.dropna(subset=['Salary'], inplace=True)
print(empleados)

empleados.drop_duplicates(subset = ['Name'], inplace=True)
print(empleados)

      Name   Age   Salary Department
0      Ana  25.0  50000.0     Ventas
1     Luis  32.0  60000.0  Marketing
2   Carlos  32.0  70000.0         TI
3    Pedro  45.0  62000.0         TI
5  Richard  32.0  70000.0  Marketing
6      Ana  25.0  50000.0     Ventas
      Name   Age   Salary Department
0      Ana  25.0  50000.0     Ventas
1     Luis  32.0  60000.0  Marketing
2   Carlos  32.0  70000.0         TI
3    Pedro  45.0  62000.0         TI
5  Richard  32.0  70000.0  Marketing

In [18]:
def salario_neto(salario):
    return salario * 0.85

empleados['Salario Neto'] = empleados['Salary'].apply(salario_neto)
print(empleados)

      Name   Age   Salary Department  Salario Neto
0      Ana  25.0  50000.0     Ventas       42500.0
1     Luis  32.0  60000.0  Marketing       51000.0
2   Carlos  32.0  70000.0         TI       59500.0
3    Pedro  45.0  62000.0         TI       52700.0
5  Richard  32.0  70000.0  Marketing       59500.0